""" Напишите программу, которая принимает на вход координаты точки (X и Y), 
причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

Пример:

- x=34; y=-30 -> 4
- x=2; y=4-> 1
- x=-34; y=-30 -> 3 """


# pos_inf = float("Inf")
# neg_inf = float("-Inf")


# x = float(input("Введите координату X -> "))
# y = float(input("Введите координату Y -> "))
# if(x == 0) or (y == 0):
#     print("Введите значения отличные от нуля")
# elif(0 < x < pos_inf) and (0 < y < pos_inf):
#     print("Номер четверти -> 1")
# elif(neg_inf < x < 0) and (0 < y < pos_inf):
#     print("Номер четверти -> 2")
# elif(neg_inf < x < 0) and (neg_inf < y < 0):
#     print("Номер четверти -> 3")
# elif(0 < x < pos_inf) and (neg_inf < y < 0):
#     print("Номер четверти -> 4")

